app/views/contents/show.html.erb

<h2>コメント一覧<h2>
<% @content.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."content_id" = $1  [["content_id", 11]]