app/controllers/comments_controller.rb

  def create
    @content = Content.find(params[:content_id])
    @comment = @content.comments.create(comment_params)
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "content_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "aaaaa"], ["content_id", 5], ["created_at", "2022-08-21 12:14:56.806154"], ["updated_at", "2022-08-21 12:14:56.806154"]]