app/controllers/contents_controller.rb

  def index
    @contents = Content.all
---
SELECT "contents".* FROM "contents"

  def create
    @content = Content.new(content_params)

    respond_to do |format|
      if @content.save
---
INSERT INTO "contents" ("name", "body", "file", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "aa"], ["body", "aa"], ["file", nil], ["created_at", "2022-08-22 02:31:40.623912"], ["updated_at", "2022-08-22 02:31:40.623912"]]

  def update
    respond_to do |format|
      if @content.update(content_params)
---
UPDATE "contents" SET "body" = $1, "updated_at" = $2 WHERE "contents"."id" = $3  [["body", "夜をイメージした曲です。\r\n去年作りました。"], ["updated_at", "2022-08-22 04:08:50.219469"], ["id", 10]]

  def destroy
    @content.destroy
---
DELETE FROM "contents" WHERE "contents"."id" = $1  [["id", 6]]

    def set_content
      @content = Content.find(params[:id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]